air-quality-service/test-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:air="http://smartcity.com/air-quality-service/schema">
   <soapenv:Header/>
   <soapenv:Body>
      <air:getAirQualityRequest>
         <air:zoneId>zone-downtown</air:zoneId>
      </air:getAirQualityRequest>
   </soapenv:Body>
</soapenv:Envelope>
